src/Enums/ВидыОперацийПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПриходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоступлениеОтПоставщика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПокупателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтКомиссионера</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратОтПереработчика</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийРасходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийРасходнаяНакладная</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПродажаПокупателю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаКомиссию</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаВПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПередачаНаОтветХранение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратПоставщику</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратКомитенту</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратИзПереработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВозвратСОтветХранения</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийСчетФактура.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетФактура</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Продажа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаАвансКомитента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаАванса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийЗаказПоставщику.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПоставщику</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаЗакупку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийЗаказПокупателя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийЗаказПокупателя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПродажу</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПереработку</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаряд</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийСчетФактураПолученный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийСчетФактураПолученный</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аванс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммовыеРазницы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Корректировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорректировкаАванса</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыОперацийИсправленияПоступленияРеализации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<Enum>
		<Properties>
			<Name>ВидыОперацийИсправленияПоступленияРеализации</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СогласованноеИзменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсправлениеОшибки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/CommonModules/РаботаСФормойДокумента/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПредставлениеДокументаОснования(ДокОснование) Экспорт
	
	// для пустых ссылок возвращаем неопределено
	Если НЕ ЗначениеЗаполнено(ДокОснование) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ОбщегоНазначения.СсылкаСуществует(ДокОснование) Тогда
		Возврат Строка(ДокОснование);
	Иначе
		Возврат "НетОбъекта";
	КонецЕсли;
	
КонецФункции

// Настроить группу ЦеныИВалюта.
// 
// Параметры:
// 	Форма - ФормаКлиентскогоПриложения - форма, в которой настраивается группа ЦеныИВалюта.
Процедура НастроитьГруппуЦеныИВалюты(Форма) Экспорт

	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Форма.Элементы.ЦеныИВалюта.МаксимальнаяШирина = Форма.Элементы.ЦеныИВалюта.МаксимальнаяШирина - 2;

		Если Форма.Элементы.Найти("ВидОперации") = Неопределено Тогда
			Форма.Элементы.ЦеныИВалюта.МаксимальнаяШирина = Форма.Элементы.ЦеныИВалюта.МаксимальнаяШирина - 2;
		КонецЕсли;

	КонецЕсли;

	Если (ПолучитьФункциональнуюОпцию("ИспользоватьДисконтныеКарты") <> Истина И Форма.Элементы.Найти(
		"СчитатьДисконтнуюКарту") <> Неопределено) Или (Форма.Элементы.Найти("СчитатьДисконтнуюКарту") <> Неопределено
		И Форма.Элементы.СчитатьДисконтнуюКарту.Видимость = Ложь) Тогда

		Форма.Элементы.ЦеныИВалюта.МаксимальнаяШирина = Форма.Элементы.ЦеныИВалюта.МаксимальнаяШирина + 4;

	КонецЕсли;

КонецПроцедуры

// Устарела. Следует использовать ОтчетыУНФ.ПолучитьПереопределенныйКомпоновщикНастроек
// или ОтчетыУНФВызовСервера.ПолучитьПереопределенныйКомпоновщикНастроек.
//
Функция ПолучитьКомпоновщикНастроекСервер(СвойстваОтчета, ПараметрыИОтборы = Неопределено) Экспорт
	
	Если ПараметрыИОтборы = Неопределено Тогда
		ПараметрыИОтборы = Новый Массив;
	КонецЕсли;
	
	Возврат ОтчетыУНФ.ПолучитьПереопределенныйКомпоновщикНастроек(СвойстваОтчета, ПараметрыИОтборы);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция РеквизитыДокументаОснования(ДокОснование) Экспорт
	
	Возврат ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДокОснование, "Номер,Дата,НомерВходящегоДокумента,ДатаВходящегоДокумента");

КонецФункции

Процедура УдалитьНедоступныеВидыОперацийДокументов(Операции) Экспорт
	
	//Комиссия
	Если НЕ ПолучитьФункциональнуюОпцию("ПриемТоваровНаКомиссию") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаКомиссию);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратКомитенту);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийСчетФактура.НаАвансКомитента);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("ПередачаТоваровНаКомиссию") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтКомиссионера);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаКомиссию);
	КонецЕсли;
	//Переработка
	Если НЕ ПолучитьФункциональнуюОпцию("ПередачаСырьяВПереработку") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийЗаказПоставщику.ЗаказНаПереработку);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратОтПереработчика);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаВПереработку);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("ПереработкаДавальческогоСырья") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаПереработку);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийПриходнаяНакладная.ПриемВПереработку);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратИзПереработки);
	КонецЕсли;
	//ОтветХранение
	Если НЕ ПолучитьФункциональнуюОпцию("ПриемЗапасовНаОтветХранение") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийПриходнаяНакладная.ПриемНаОтветХранение);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийРасходнаяНакладная.ВозвратСОтветХранения);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("ПередачаЗапасовНаОтветХранение") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийПриходнаяНакладная.ВозвратСОтветХранения);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийРасходнаяНакладная.ПередачаНаОтветхранение);
	КонецЕсли;
	//Корректировки
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиРеализаций") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийСчетФактура.Корректировка);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиПоступлений") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийСчетФактураПолученный.Корректировка);
	КонецЕсли;
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиРеализаций") И НЕ ПолучитьФункциональнуюОпцию("ИспользоватьКорректировкиПоступлений") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийИсправленияПоступленияРеализации.ИсправлениеОшибки);
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийИсправленияПоступленияРеализации.СогласованноеИзменение);
	КонецЕсли;	
	
	//Работы
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьПодсистемуРаботы") Тогда
		УдалитьОперацию(Операции, Перечисления.ВидыОперацийЗаказПокупателя.ЗаказНаряд);
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьОперацию(Операции, ЗначениеУдаления)
	
	Если ТипЗнч(Операции) = Тип("СписокЗначений") Тогда
		СтрокаДляУдаления = Операции.НайтиПоЗначению(ЗначениеУдаления);
		Если СтрокаДляУдаления<>Неопределено Тогда
			Операции.Удалить(СтрокаДляУдаления);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Операции) = Тип("ДеревоЗначений") Тогда
		НайтиУдалитьВДереве(Операции, ЗначениеУдаления);
	КонецЕсли;

КонецПроцедуры

Процедура НайтиУдалитьВДереве(Операции, ЗначениеУдаления)
	
	Для Каждого Док Из Операции.Строки Цикл
		
		ПодчиненныеОперации = док.Строки;
		Для Каждого операция Из ПодчиненныеОперации Цикл
			Если операция.ВидОперации = ЗначениеУдаления Тогда
				ПодчиненныеОперации.Удалить(операция);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Для Каждого Док Из Операции.Строки Цикл
		Если Док.Строки.Количество()=0 Тогда
			Операции.Строки.Удалить(Док);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СсылкаВариантаОтчета(ИмяОтчета, КлючВарианта) Экспорт
	
	Отчет = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Отчет."+ИмяОтчета);
	Возврат ВариантыОтчетов.ВариантОтчета(Отчет, КлючВарианта);
	
КонецФункции

#КонецОбласти

#Область РаботаССериямиНоменклатуры

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилища
Функция ПолучитьСерииНоменклатурыИзХранилища(Объект, АдресЗапасовВХранилище, КлючСвязи, ПараметрыИменаПолей=Неопределено) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилища(Объект, АдресЗапасовВХранилище, КлючСвязи, ПараметрыИменаПолей);
	
КонецФункции // ПолучитьСерииНоменклатурыИзХранилища()

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилищаДляПоляВвода
Функция ПолучитьСерииНоменклатурыИзХранилищаДляПоляВвода(Объект, АдресЗапасовВХранилище) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПолучитьСерииНоменклатурыИзХранилищаДляПоляВвода(Объект, АдресЗапасовВХранилище);
	
КонецФункции // ПолучитьСерииНоменклатурыИзХранилища()

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПолучитьСерияИзХранилища
Функция ПолучитьСерияИзХранилища(Объект, АдресЗапасовВХранилище) Экспорт
	
	СерииНоменклатурыУНФ.ПолучитьСерияИзХранилища(Объект, АдресЗапасовВХранилище);
	
КонецФункции // ПолучитьСерииНоменклатурыИзХранилища()

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатуры
Функция ПараметрыПодбораСерийНоменклатуры(ДокОбъект, УИДФормы, ИДСтроки, РежимПодбора = Неопределено, ИмяТЧ="Запасы", ИмяТЧСерийНоменклатуры="СерииНоменклатуры", ИмяПоляКлючСвязи = "КлючСвязи",
	ЭтоОприходование = Ложь) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатуры(ДокОбъект, УИДФормы, ИДСтроки, РежимПодбора, ИмяТЧ, ИмяТЧСерийНоменклатуры, ИмяПоляКлючСвязи, ЭтоОприходование);
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПодготовитьПараметрыСерийНоменклатуры
Функция ПодготовитьПараметрыСерийНоменклатуры(ДокОбъект, ТекСтрокаДанные, УИДФормы, ИмяТЧ = "Запасы", ИмяТЧСерийНоменклатуры="СерииНоменклатуры", ИмяПоляКлючСвязи = "КлючСвязи",
	ЭтоОприходование = Ложь) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПодготовитьПараметрыСерийНоменклатуры(ДокОбъект, ТекСтрокаДанные, УИДФормы, ИмяТЧ, ИмяТЧСерийНоменклатуры, ИмяПоляКлючСвязи, ЭтоОприходование);
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатурыВПолеВвода
Функция ПараметрыПодбораСерийНоменклатурыВПолеВвода(ДокОбъект, УИДФормы, РежимПодбора = Неопределено) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатурыВПолеВвода(ДокОбъект, УИДФормы, РежимПодбора);
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатурыДляРемонтов
Функция ПараметрыПодбораСерийНоменклатурыДляРемонтов(ДокОбъект, УИДФормы, РежимПодбора = Неопределено) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПараметрыПодбораСерийНоменклатурыДляРемонтов(ДокОбъект, УИДФормы, РежимПодбора);
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.ПолучитьДанныеНоменклатураПриИзменении
Функция ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные) Экспорт
	
	Возврат СерииНоменклатурыУНФ.ПолучитьДанныеНоменклатураПриИзменении(СтруктураДанные);
	
КонецФункции

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФ.РассчитатьСуммуВСтрокеТабличнойЧасти
Процедура РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, СуммаВключаетНДС) Экспорт
	
	СерииНоменклатурыУНФ.РассчитатьСуммуВСтрокеТабличнойЧасти(СтрокаТабличнойЧасти, СуммаВключаетНДС);
	
КонецПроцедуры // РассчитатьСуммуВСтрокеТабличнойЧасти()

// Устарела. Будет удалена в следующей версии программы. 
// См. СерииНоменклатурыУНФВызовСервера.ЗаполнитьКлючиСвязи
Процедура ЗаполнитьКлючиСвязи(Объект, ИмяТЧ, ИмяПоляКлючСвязи = "КлючСвязи") Экспорт
	
	СерииНоменклатурыУНФ.ЗаполнитьКлючиСвязи(Объект, ИмяТЧ, ИмяПоляКлючСвязи);
	
КонецПроцедуры // ЗаполнитьКлючиСвязиВТабличнойЧастиТовары()

#КонецОбласти
